JianHsu/ble_cc26xx_2_01_01_44627/Projects/ble/HIDEmuKbd/CC26xx/Source/Application/main.c
/**
  @file  main.c
  Revised:        $Date: 2015-05-22 07:14:53 -0700 (Fri, 22 May 2015) $
  Revision:       $Revision: 43907 $

  @brief main entry of the BLE stack sample application.

  <!--
  Copyright 2013 - 2015 Texas Instruments Incorporated. All rights reserved.

  IMPORTANT: Your use of this Software is limited to those specific rights
  granted under the terms of a software license agreement between the user
  who downloaded the software, his/her employer (which must be your employer)
  and Texas Instruments Incorporated (the "License").  You may not use this
  Software unless you agree to abide by the terms of the License. The License
  limits your use, and you acknowledge, that the Software may not be modified,
  copied or distributed unless embedded on a Texas Instruments microcontroller
  or used solely and exclusively in conjunction with a Texas Instruments radio
  frequency transceiver, which is integrated into your product.  Other than for
  the foregoing purpose, you may not use, reproduce, copy, prepare derivative
  works of, modify, distribute, perform, display or sell this Software and/or
  its documentation for any purpose.

  YOU FURTHER ACKNOWLEDGE AND AGREE THAT THE SOFTWARE AND DOCUMENTATION ARE
  PROVIDED ``AS IS" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED,
  INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE,
  NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL
  TEXAS INSTRUMENTS OR ITS LICENSORS BE LIABLE OR OBLIGATED UNDER CONTRACT,
  NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR OTHER
  LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES
  INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE
  OR CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, COST OF PROCUREMENT
  OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES
  (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.

  Should you have any questions regarding your right to use this Software,
  contact Texas Instruments Incorporated at www.TI.com.
  -->
*/

#include <xdc/runtime/Error.h>
#include <ti/sysbios/family/arm/cc26xx/Power.h>
#include <ti/sysbios/BIOS.h>
#include <ti/sysbios/knl/Clock.h>
#include <ti/sysbios/knl/Task.h>

#include <ti/drivers/pin/PINCC26XX.h>
#include <ti/drivers/I2C.h>
#include "ICall.h"
#include "bcomdef.h"
#include "peripheral.h"
#include "hiddev.h"
#include "hidemukbd.h"
#include "util.h"

#include "myuart.h"
/* Header files required to enable instruction fetch cache */
#include <inc/hw_memmap.h>
#include <driverlib/vims.h>

#ifndef USE_DEFAULT_USER_CFG

#include "bleUserConfig.h"

// BLE user defined configuration
bleUserCfg_t user0Cfg = BLE_USER_CFG;

#endif // USE_DEFAULT_USER_CFG

volatile uint8_t i2c_flag = 0;
uint8_t cnt_1s = 0;
/**
 * Exception handler
 */
void exceptionHandler()
{
    while(1){}
}
Clock_Handle clkHandle;

/*Clock 100ms*/
Void clkFxn(UArg arg0)
{
    PINCC26XX_setOutputValue(Board_GLED, PINCC26XX_getOutputValue(Board_GLED) ^ 1);
    cnt_1s++;
    if (cnt_1s >= 10){
        cnt_1s = 0;
        Uart_Print("1s\r\n");
    }

    Clock_start(clkHandle);
}

#define TASKSTACKSIZE       1024
Task_Struct task0Struct;
Char task0Stack[TASKSTACKSIZE];

/*
 *  ======== echoFxn ========
 *  Task for this function is created statically. See the project's .cfg file.
 */
Void taskFxn(UArg arg0, UArg arg1)
{
    uint8_t i = 0;
    uint8_t         txBuffer[1];
    uint8_t         rxBuffer[1];
    I2C_Handle      i2c;
    I2C_Params      i2cParams;
    I2C_Transaction i2cTransaction;

    Board_initI2C();

    /* Create I2C for usage */
    I2C_Params_init(&i2cParams);
    i2cParams.bitRate = I2C_400kHz;
    i2c = I2C_open(Board_I2C, &i2cParams);
    if (i2c == NULL) {
        Uart_Print("Error Initializing I2C\n");
    }

    /* Point to the T ambient register and read its 2 bytes */
    txBuffer[0] = 0x75; //WHO AM I
    i2cTransaction.slaveAddress = 0x68;
    i2cTransaction.writeBuf = txBuffer;
    i2cTransaction.writeCount = 1;
    i2cTransaction.readBuf = rxBuffer;
    i2cTransaction.readCount = 1;


    for (i = 0; i < 10; i++){
        if (I2C_transfer(i2c, &i2cTransaction)) {
            Uart_Putchar(rxBuffer[0]);
        }
        else {
            Uart_Print("I2C Bus fault\n");
        }
    }


    /* Deinitialized I2C */
    I2C_close(i2c);
    //Uart_Print("I2C closed!\n");
}
/*
 *  ======== main ========
 */
int main()
{
    Clock_Params clockParams;
    Task_Params taskParams;

    PIN_init(BoardGpioInitTable);

    /* Uart Task*/
    Uart_createTask();

    /*Timer*/
    Clock_Params_init(&clockParams);
    clockParams.period = 0;
    clockParams.startFlag = TRUE;
    clkHandle = Clock_create(clkFxn, 10000, &clockParams, NULL);

    /*I2C*/
    Task_Params_init(&taskParams);
    taskParams.stackSize = TASKSTACKSIZE;
    taskParams.stack = &task0Stack;
    Task_construct(&task0Struct, (Task_FuncPtr)taskFxn, &taskParams, NULL);

#ifndef POWER_SAVING
    /* Set constraints for Standby, powerdown and idle mode */
    Power_setConstraint  (Power_SB_DISALLOW);
    Power_setConstraint  (Power_IDLE_PD_DISALLOW);
#endif //POWER_SAVING

    /* Initialize ICall module */
    ICall_init();

    /* Start tasks of external images - Priority 5 */
    ICall_createRemoteTasks();

    /* Kick off profile - Priority 3 */
    GAPRole_createTask();
    
    /* Kick off HID service task - Priority 2 */
    HidDev_createTask();
    
    /* Kick off application - Priority 1 */
    HidEmuKbd_createTask();

    /* enable interrupts and start SYS/BIOS */
    BIOS_start();

    return 0;
}

/**
 * Error handled to be hooked into TI-RTOS
 */
Void smallErrorHook(Error_Block *eb)
{
  for (;;);
}

/**
 * HAL assert handler required by OSAL memory module.
 */
void halAssertHandler(void)
{
  for (;;);
}
